MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_icache.c
- Maintenance operation:
  - Override weak definition for following callbacks:
     - HAL_ICACHE_InvalidateCompleteCallback()
  - Or use register callbacks (USE_HAL_ICACHE_REGISTER_CALLBACKS = 1):
     - HAL_ICACHE_RegisterInvalidateCompleteCallback()
  - Launch a maintenance operation with interrupt: HAL_ICACHE_Invalidate_IT().

## HAL ICACHE Driver State
- Use HAL_ICACHE_GetState() to return the HAL ICACHE state.

## HAL ICACHE Driver Accessor and Instance
- Use HAL_ICACHE_SetUserData() to set user data associated to the ICACHE handle.
- Use HAL_ICACHE_GetUserData() to get user data associated to the ICACHE handle.
- Use HAL_ICACHE_GetInstance() function to return the HAL ICACHE instance associated to the handle.
- Use HAL_ICACHE_GetLLInstance() function to return the LL ICACHE instance associated to the handle.

  */
/**
  * @}
  */

/** @defgroup ICACHE_Configuration_Table ICACHE Configuration Table
  * @{
## Configuration inside the ICACHE driver :

Config defines                    | Description     | Default value | Note                                          |
--------------------------------- | ----------------| ------------- | ----------------------------------------------|
USE_HAL_ICACHE_MODULE             | From hal_conf.h |       1       | Allows the use of the HAL ICACHE module.      |
USE_HAL_ICACHE_REGISTER_CALLBACKS | From hal_conf.h |       0       | Allows the use of the register callbacks.     |
USE_HAL_CHECK_PARAM               | From hal_conf.h |       0       | Allows the use of run-time check parameters.  |
USE_ASSERT_DBG_PARAM              | From IDE        |     None      | Allows the use of assert check parameters.    |
USE_ASSERT_DBG_STATE              | From IDE        |     None      | Allows the use of assert check states.        |
USE_HAL_ICACHE_GET_LAST_ERRORS    | From hal_conf.h |       0       | Allows the use of the error code mechanism.   |
USE_HAL_ICACHE_USER_DATA          | From hal_conf.h |       0       | Allows the use of user data.                  |
  */
/**
  * @}
  */

/* Private defines -----------------------------------------------------------*/
/** @defgroup ICACHE_Private_Defines ICACHE Private Defines
  * @{
  */
#define ICACHE_MAINTENANCE_TIMEOUT_VALUE           1U   /*!< 1ms */
/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/** @defgroup ICACHE_Private_Macros ICACHE Private Macros
  * @{
  */

/**
  * @brief Monitor type
  */
#define IS_ICACHE_MONITOR_TYPE(type)  (((type) & ~HAL_ICACHE_MONITOR_ALL) == 0U)

/**
  * @brief Error Interrupt
  */
#define IS_ICACHE_IT(it)      (((it) & ~HAL_ICACHE_IT_ERROR) == 0U)

/**
  * @brief Associativity Mode
  */
#define IS_ICACHE_ASSOCIATIVITY_MODE(mode)  (((mode) == HAL_ICACHE_ASSOCIATIVITY_1WAY) \
                                             || ((mode) == HAL_ICACHE_ASSOCIATIVITY_2WAYS))

/**
  * @brief Region number
  */
#define IS_ICACHE_REGION_NUMBER(number)    (((number) == HAL_ICACHE_REGION_0) \
                                            || ((number) == HAL_ICACHE_REGION_1) \
                                            || ((number) == HAL_ICACHE_REGION_2) \
                                            || ((number) == HAL_ICACHE_REGION_3))

/**
  * @brief Region base address
  */
#define IS_ICACHE_REGION_BASE_ADDRESS(baseaddr)  ((baseaddr) <= 0x1FFFFFFFUL)

/**
  * @brief Region size
  */
#define IS_ICACHE_REGION_SIZE(size)     (((size) == HAL_ICACHE_REGION_SIZE_2MBYTES)   \
                                         || ((size) == HAL_ICACHE_REGION_SIZE_4MBYTES)   \
                                         || ((size) == HAL_ICACHE_REGION_SIZE_8MBYTES)   \
                                         || ((size) == HAL_ICACHE_REGION_SIZE_16MBYTES)  \
                                         || ((size) == HAL_ICACHE_REGION_SIZE_32MBYTES)  \
                                         || ((size) == HAL_ICACHE_REGION_SIZE_64MBYTES)  \
                                         || ((size) == HAL_ICACHE_REGION_SIZE_128MBYTES))

/**
  * @brief Region master port
  */
#if defined(LL_ICACHE_MASTER2_PORT)
#define IS_ICACHE_REGION_MASTER_PORT(masterport)  (((masterport) == HAL_ICACHE_MASTER1_PORT) \
                                                   || ((masterport) == HAL_ICACHE_MASTER2_PORT))
#else
#define IS_ICACHE_REGION_MASTER_PORT(masterport)  (((masterport) == HAL_ICACHE_MASTER1_PORT))
#endif /* HAL_ICACHE_MASTER2_PORT */

/**
  * @brief Region output burst
  */
#define IS_ICACHE_REGION_BURST(burst) (((burst) == HAL_ICACHE_BURST_WRAP) \
                                       || ((burst) == HAL_ICACHE_BURST_INCR))
/**
  * @}
  */

/* Private types -------------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Exported functions --------------------------------------------------------*/
/** @addtogroup ICACHE_Exported_Functions
  * @{
  */

/** @addtogroup ICACHE_Exported_Functions_Group1
  * @{
This section provides functions to initialize and deinitialize the ICACHE peripheral:
- Call the function HAL_ICACHE_Init() to initialize the selected ICACHE handle and associate an instance.
- Call the function HAL_ICACHE_DeInit():
  - to reset the ICACHE to the initial state by resetting the monitors,
  - to reset and disable remap regions,
  - to set burst type to WRAP mode, master1 port selected, 2-ways associativity mode,
  - to disable interrupts,
  - to reset and stop ongoing commands if any,
  - to stop the cache and clear the flags.
  */

/**
  * @brief  Initialize the ICACHE according to the associated handle.
  * @param  hicache Pointer to a hal_icache_handle_t structure that contains
  *              the handle information for the specified ICACHE.
  * @param  instance ICACHE instance.
  * @retval HAL_INVALID_PARAM When the handle is NULL.
  * @retval HAL_OK            HAL ICACHE driver correctly Initialized for the given ICACHE instance.
  */
hal_status_t HAL_ICACHE_Init(hal_icache_handle_t *hicache, hal_icache_t instance)
{
  /* Check the ICACHE handle allocation */
  ASSERT_DBG_PARAM(hicache != NULL);

  ASSERT_DBG_PARAM(IS_ICACHE_ALL_INSTANCE((ICACHE_TypeDef *)(uint32_t)instance));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  /* Check the handle struct pointer */
  if (hicache == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hicache->instance = instance;

