MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_icache.c
#if defined(USE_HAL_ICACHE_REGISTER_CALLBACKS) && (USE_HAL_ICACHE_REGISTER_CALLBACKS == 1)
  /* Initialize the ICACHE Callback settings */
  hicache->p_error_cb            = HAL_ICACHE_ErrorCallback;  /* Error Callback */
  hicache->p_invalidate_cplt_cb  = HAL_ICACHE_InvalidateCompleteCallback;  /* Invalidate complete Callback */
#endif /* USE_HAL_ICACHE_REGISTER_CALLBACKS */

#if defined(USE_HAL_ICACHE_GET_LAST_ERRORS) && (USE_HAL_ICACHE_GET_LAST_ERRORS == 1)
  /* If only a single process runs at a time, a single variable stores the last errors. */
  hicache->last_error_codes = HAL_ICACHE_ERROR_NONE;
#endif /* USE_HAL_ICACHE_GET_LAST_ERRORS */

  /* Initialize the ICACHE handle global_state */
  hicache->global_state = HAL_ICACHE_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  DeInitialize the ICACHE.
  * @param  hicache Pointer to a hal_icache_handle_t structure that contains
  *                 the handle information for the specified ICACHE instance.
  * @note   The goal of this function is to reset the ICACHE to the initial state:
  *           - stop the ICACHE,
  *           - disable and reset the monitors,
  *           - set the associativity in 2-ways mode (default),
  *           - disable the interrupts,
  *           - clear the interrupt flags,
  *           - disable and reset the remapped regions,
  *           - and reset the last error code.
  */
void HAL_ICACHE_DeInit(hal_icache_handle_t *hicache)
{
  ICACHE_TypeDef *p_icachex;

  /* Check the ICACHE handle allocation */
  ASSERT_DBG_PARAM(hicache != NULL);

  /* Check the global state */
  ASSERT_DBG_STATE(hicache->global_state, \
                   (uint32_t)HAL_ICACHE_STATE_IDLE | \
                   (uint32_t)HAL_ICACHE_STATE_ACTIVE | \
                   (uint32_t)HAL_ICACHE_STATE_MAINTENANCE);

  p_icachex = (ICACHE_TypeDef *)((uint32_t)hicache->instance);

  LL_ICACHE_Disable(p_icachex);

  LL_ICACHE_ResetMonitors(p_icachex, LL_ICACHE_MONITOR_ALL);

  /* Reset the Control Register: 2-ways associativity mode is set, maintenance operation finished,
     ICACHE and monitors disabled */
  LL_ICACHE_WRITE_REG(p_icachex, CR, LL_ICACHE_2WAYS);

  /* Reset the Interrupt Enable Register: clear ERRIE and BSYENDIE flags */
  LL_ICACHE_WRITE_REG(p_icachex, IER, 0U);

  /* Reset the Flag Clear Register: clear ERR and BSYEND flags */
  LL_ICACHE_ClearFlag(p_icachex, LL_ICACHE_FCR_ALL);

  /* Reset and disable remapped regions */
  LL_ICACHE_WRITE_REG(p_icachex, CRR0, ICACHE_CRRx_RSIZE_0);
  LL_ICACHE_WRITE_REG(p_icachex, CRR1, ICACHE_CRRx_RSIZE_0);
  LL_ICACHE_WRITE_REG(p_icachex, CRR2, ICACHE_CRRx_RSIZE_0);
  LL_ICACHE_WRITE_REG(p_icachex, CRR3, ICACHE_CRRx_RSIZE_0);

#if defined(USE_HAL_ICACHE_GET_LAST_ERRORS) && (USE_HAL_ICACHE_GET_LAST_ERRORS == 1)
  /* If only a single process runs at a time, a single variable stores the last errors. */
  hicache->last_error_codes = HAL_ICACHE_ERROR_NONE;
#endif /* USE_HAL_ICACHE_GET_LAST_ERRORS */

  hicache->global_state = HAL_ICACHE_STATE_RESET;
}
/**
  * @}
  */

/** @addtogroup ICACHE_Exported_Functions_Group2
  * @{
This section provides functions to configure the ICACHE peripheral:
- HAL_ICACHE_SetAssociativityMode() to set the chosen associativity mode.
- HAL_ICACHE_GetAssociativityMode() to read the current associativity mode.
- HAL_ICACHE_SetConfigRemapRegion() to configure the different fields in the region remap register.
- HAL_ICACHE_GetConfigRemapRegion() to read the different fields in the region remap register.
  */

/**
  * @brief  Set the ICACHE associativity mode selection.
  * @param  hicache Pointer to a hal_icache_handle_t structure that contains
  *                the handle information for the specified ICACHE instance.
  * @param  mode Associativity mode to be applied.
  * @note   If ICACHE is enabled, the mode cannot be set.
  * @retval HAL_OK ICACHE associativity mode has been correctly configured.
  */
hal_status_t HAL_ICACHE_SetAssociativityMode(hal_icache_handle_t *hicache, hal_icache_associativity_t mode)
{
  ICACHE_TypeDef *p_icachex;

  /* Check the ICACHE handle allocation */
  ASSERT_DBG_PARAM(hicache != NULL);

  ASSERT_DBG_PARAM(IS_ICACHE_ASSOCIATIVITY_MODE(mode));

  /* Check the global state */
  ASSERT_DBG_STATE(hicache->global_state, HAL_ICACHE_STATE_IDLE);

  p_icachex = (ICACHE_TypeDef *)((uint32_t)hicache->instance);

  LL_ICACHE_SetMode(p_icachex, (uint32_t)mode);

  return HAL_OK;
}


/**
  * @brief  Get the ICACHE associativity mode selection.
  * @param hicache Pointer to a hal_icache_handle_t structure that contains
  *                the handle information for the specified ICACHE instance.
  * @retval HAL_ICACHE_ASSOCIATIVITY_1WAY Associativity mode is 1-way.
  * @retval HAL_ICACHE_ASSOCIATIVITY_2WAYS Associativity mode is 2-ways.
  */
hal_icache_associativity_t HAL_ICACHE_GetAssociativityMode(const hal_icache_handle_t *hicache)
{
  ICACHE_TypeDef *p_icachex;

  /* Check the ICACHE handle allocation */
  ASSERT_DBG_PARAM(hicache != NULL);

  p_icachex = (ICACHE_TypeDef *)((uint32_t)hicache->instance);

  return ((hal_icache_associativity_t)LL_ICACHE_GetMode(p_icachex));
}

/**
  * @brief  Configure the ICACHE remap region.
  * @param  hicache Pointer to a hal_icache_handle_t structure that contains
  *                the handle information for the specified ICACHE instance.
  * @param  region Region number.
  * @param  p_region_config Pointer to region config structure.
  * @note   If ICACHE is enabled, the remap region cannot be set.
  * @retval HAL_OK ICACHE remap region has been correctly initialized.
  */
hal_status_t HAL_ICACHE_SetConfigRemapRegion(hal_icache_handle_t *hicache, hal_icache_region_t region,
                                             const hal_icache_region_config_t *p_region_config)
{
  ICACHE_TypeDef *p_icachex;

  /* Check the ICACHE handle allocation */
  ASSERT_DBG_PARAM(hicache != NULL);

  ASSERT_DBG_PARAM(IS_ICACHE_REGION_NUMBER(region));

  /* Check region allocation */
  ASSERT_DBG_PARAM(p_region_config != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  /* Check the region struct pointer */
  if (p_region_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Check region parameters */
  ASSERT_DBG_PARAM(IS_ICACHE_REGION_BASE_ADDRESS(p_region_config->base_address));
  ASSERT_DBG_PARAM(IS_ICACHE_REGION_SIZE(p_region_config->size));
  ASSERT_DBG_PARAM(IS_ICACHE_REGION_MASTER_PORT(p_region_config->master_port));
  ASSERT_DBG_PARAM(IS_ICACHE_REGION_BURST(p_region_config->output_burst));

  /* Check the global state */
  ASSERT_DBG_STATE(hicache->global_state, HAL_ICACHE_STATE_IDLE);

  p_icachex = (ICACHE_TypeDef *)((uint32_t)hicache->instance);

  LL_ICACHE_SetConfigRemapRegion(p_icachex, (uint32_t)region, p_region_config->base_address,
                                 p_region_config->remap_address, (uint32_t)p_region_config->size,
                                 (uint32_t)p_region_config->master_port, (uint32_t)p_region_config->output_burst);
  return HAL_OK;
}

/**
  * @brief  Get the ICACHE remap region configuration.
  * @param  hicache Pointer to a hal_icache_handle_t structure that contains
  *                 the handle information for the specified ICACHE instance.
  * @param  region Region number.
  * @param  p_region_config Pointer to config region structure.
  */
void HAL_ICACHE_GetConfigRemapRegion(const hal_icache_handle_t *hicache, hal_icache_region_t region,
                                     hal_icache_region_config_t *p_region_config)
{
  uint32_t config;
  ICACHE_TypeDef *p_icachex;

  /* Check the ICACHE handle allocation */
  ASSERT_DBG_PARAM(hicache != NULL);

  ASSERT_DBG_PARAM(IS_ICACHE_REGION_NUMBER(region));

