MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_icache.c
  /* Check region allocation */
  ASSERT_DBG_PARAM(p_region_config != NULL);

  p_icachex = (ICACHE_TypeDef *)((uint32_t)hicache->instance);

  config = LL_ICACHE_GetConfigRemapRegion(p_icachex, (uint32_t)region);

  p_region_config->base_address = STM32_READ_BIT(config, ICACHE_CRRx_BASEADDR) << LL_ICACHE_ADDRESS_SHIFT;
  p_region_config->remap_address = (STM32_READ_BIT(config, ICACHE_CRRx_REMAPADDR) >> ICACHE_CRRx_REMAPADDR_Pos)
                                   << LL_ICACHE_ADDRESS_SHIFT;
  p_region_config->size = (hal_icache_region_size_t)(uint32_t)(STM32_READ_BIT(config, ICACHE_CRRx_RSIZE)
                                                               >> ICACHE_CRRx_RSIZE_Pos);
#if defined(LL_ICACHE_MASTERPORT_MASK) && (LL_ICACHE_MASTERPORT_MASK != 0U)
  p_region_config->master_port = (hal_icache_master_port_t)(uint32_t)STM32_READ_BIT(config, LL_ICACHE_MASTERPORT_MASK);
#else
  p_region_config->master_port = (hal_icache_master_port_t)HAL_ICACHE_MASTER1_PORT;
#endif /* LL_ICACHE_MASTERPORT_MASK */
  p_region_config->output_burst = (hal_icache_region_burst_t)(uint32_t)STM32_READ_BIT(config, ICACHE_CRRx_HBURST);
}
/**
  * @}
  */

/** @addtogroup ICACHE_Exported_Functions_Group3
  * @{
The functions are :
- HAL_ICACHE_Start() to start the ICACHE with error interrupt control.
- HAL_ICACHE_Stop() to stop the ICACHE.
- HAL_ICACHE_EnableRemapRegion() to enable the configured region.
- HAL_ICACHE_DisableRemapRegion() to disable the corresponding region.
- HAL_ICACHE_IsEnabledRemapRegion() to ensure if the corresponding region is enabled or not.
  */

/**
  * @brief  Start ICACHE.
  * @param  hicache Pointer to a hal_icache_handle_t structure that contains
  *                 the handle information for the specified ICACHE instance.
  * @param  interrupts Interrupts
  *            @arg HAL_ICACHE_IT_NONE
  *            @arg HAL_ICACHE_IT_ERROR
  * @note This function can enable the interrupts, and starts the ICACHE.
  * @retval HAL_OK Only success, even if there is any ongoing cache operation.
  */
hal_status_t HAL_ICACHE_Start(hal_icache_handle_t *hicache, uint32_t interrupts)
{
  ICACHE_TypeDef *p_icachex;

  ASSERT_DBG_PARAM(hicache != NULL);
  ASSERT_DBG_PARAM(IS_ICACHE_IT(interrupts));

  ASSERT_DBG_STATE(hicache->global_state, HAL_ICACHE_STATE_IDLE);

  HAL_CHECK_UPDATE_STATE(hicache, global_state, HAL_ICACHE_STATE_IDLE, HAL_ICACHE_STATE_ACTIVE);

  p_icachex = (ICACHE_TypeDef *)((uint32_t)hicache->instance);

#if defined(USE_HAL_ICACHE_GET_LAST_ERRORS) && (USE_HAL_ICACHE_GET_LAST_ERRORS == 1)
  hicache->last_error_codes = HAL_ICACHE_ERROR_NONE;
#endif /* USE_HAL_ICACHE_GET_LAST_ERRORS */

  LL_ICACHE_EnableIT(p_icachex, interrupts);
  LL_ICACHE_Enable(p_icachex);

  return HAL_OK;
}

/**
  * @brief  Stop ICACHE.
  * @param  hicache Pointer to a hal_icache_handle_t structure that contains
  *                 the handle information for the specified ICACHE instance.
  * @note This function disables interrupts, clears the flags and stops the ICACHE.
  * @note   This function disables the Error Interrupt detection following an eviction or a clean operation,
            clears the error flag and stop the ICACHE driver.
  * @retval HAL_OK Operation completed successfully.
  */
hal_status_t HAL_ICACHE_Stop(hal_icache_handle_t *hicache)
{
  ICACHE_TypeDef *p_icachex;

  /* Check the ICACHE handle allocation */
  ASSERT_DBG_PARAM(hicache != NULL);

  /* Check the global state */
  ASSERT_DBG_STATE(hicache->global_state, \
                   (uint32_t)HAL_ICACHE_STATE_ACTIVE | \
                   (uint32_t)HAL_ICACHE_STATE_MAINTENANCE);

  p_icachex = (ICACHE_TypeDef *)((uint32_t)hicache->instance);

  LL_ICACHE_Disable(p_icachex);

  LL_ICACHE_DisableIT_ERR(p_icachex);

  LL_ICACHE_ClearFlag_ERR(p_icachex);

  hicache->global_state = HAL_ICACHE_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Enable the memory remapping for a predefined region.
  * @param  hicache Pointer to the ICACHE handle.
  * @param  region Region number.
  * @note   If ICACHE is enabled, the remap region cannot be enabled.
  * @retval HAL_OK ICACHE remap region has been correctly activated.
  */
hal_status_t HAL_ICACHE_EnableRemapRegion(hal_icache_handle_t *hicache, hal_icache_region_t region)
{
  ICACHE_TypeDef *p_icachex;

  /* Check the ICACHE handle allocation */
  ASSERT_DBG_PARAM(hicache != NULL);

  ASSERT_DBG_PARAM(IS_ICACHE_REGION_NUMBER(region));

  /* Check the global state */
  ASSERT_DBG_STATE(hicache->global_state, HAL_ICACHE_STATE_IDLE);

  p_icachex = (ICACHE_TypeDef *)((uint32_t)hicache->instance);

  LL_ICACHE_EnableRegion(p_icachex, (uint32_t)region);

  return HAL_OK;
}

/**
  * @brief  Disable the memory remapping for a predefined region.
  * @param  hicache Pointer to the ICACHE handle.
  * @param  region Region number.
  * @note   If ICACHE is enabled, the remap region cannot be disabled.
  * @retval HAL_OK ICACHE remap region has been correctly de-activated.
  */
hal_status_t  HAL_ICACHE_DisableRemapRegion(hal_icache_handle_t *hicache, hal_icache_region_t region)
{
  ICACHE_TypeDef *p_icachex;

  /* Check the ICACHE handle allocation */
  ASSERT_DBG_PARAM(hicache != NULL);

  ASSERT_DBG_PARAM(IS_ICACHE_REGION_NUMBER(region));

  /* Check the global state */
  ASSERT_DBG_STATE(hicache->global_state, HAL_ICACHE_STATE_IDLE);

  p_icachex = (ICACHE_TypeDef *)((uint32_t)hicache->instance);

  LL_ICACHE_DisableRegion(p_icachex, (uint32_t)region);

  return HAL_OK;
}

/**
  * @brief  Check if corresponding region is enabled or not.
  * @param  hicache Pointer to the ICACHE handle.
  * @param  region Region number.
  * @retval HAL_ICACHE_REMAP_REGION_DISABLED Remap region is disabled.
  * @retval HAL_ICACHE_REMAP_REGION_ENABLED  Remap region is enabled.
  */
hal_icache_remap_region_status_t HAL_ICACHE_IsEnabledRemapRegion(const hal_icache_handle_t *hicache,
                                                                 hal_icache_region_t region)
{
  ICACHE_TypeDef *p_icachex;

  /* Check the ICACHE handle allocation */
  ASSERT_DBG_PARAM(hicache != NULL);

  ASSERT_DBG_PARAM(IS_ICACHE_REGION_NUMBER(region));

  /* Check the global state */
  ASSERT_DBG_STATE(hicache->global_state,
                   (uint32_t)HAL_ICACHE_STATE_IDLE | \
                   (uint32_t)HAL_ICACHE_STATE_ACTIVE | \
                   (uint32_t)HAL_ICACHE_STATE_MAINTENANCE);

  p_icachex = (ICACHE_TypeDef *)((uint32_t)hicache->instance);

  return ((hal_icache_remap_region_status_t)LL_ICACHE_IsEnabledRegion(p_icachex, (uint32_t)region));
}

/**
  * @}
  */

