MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_icache.c
/** @addtogroup ICACHE_Exported_Functions_Group5
  * @{
This section provides functions to monitor ICACHE:
 - Call HAL_ICACHE_EnableMonitors() to enable the Instruction Cache performance monitoring.
 - Call HAL_ICACHE_DisableMonitors() to disable the Instruction Cache performance monitoring.
 - Call HAL_ICACHE_ResetMonitors() to reset the Instruction Cache performance monitoring values.
 - Call HAL_ICACHE_GetMonitorHitValue() to get the Instruction Cache performance Hit monitoring value.
 - Call HAL_ICACHE_GetMonitorMissValue() to get the Instruction Cache performance Miss monitoring value.
  */
/**
  * @brief  Enable the ICACHE performance monitoring.
  * @param  hicache Pointer to a hal_icache_handle_t structure that contains
  *                 the handle information for the specified ICACHE instance.
  * @param  monitor_type It can be a combination of the following values:
  *            @arg HAL_ICACHE_MONITOR_HIT
  *            @arg HAL_ICACHE_MONITOR_MISS
  *            @arg HAL_ICACHE_MONITOR_ALL
  * @retval HAL_OK ICACHE Monitor(s) enabled successfully.
  */
hal_status_t HAL_ICACHE_EnableMonitors(hal_icache_handle_t *hicache, uint32_t monitor_type)
{
  ICACHE_TypeDef *p_icachex;

  /* Check the ICACHE handle allocation */
  ASSERT_DBG_PARAM(hicache != NULL);

  /* Check the monitor type (HIT, MISS or both) */
  ASSERT_DBG_PARAM(IS_ICACHE_MONITOR_TYPE(monitor_type));

  /* Check the global state */
  ASSERT_DBG_STATE(hicache->global_state,
                   (uint32_t)HAL_ICACHE_STATE_IDLE | \
                   (uint32_t)HAL_ICACHE_STATE_ACTIVE | \
                   (uint32_t)HAL_ICACHE_STATE_MAINTENANCE);

  p_icachex = (ICACHE_TypeDef *)((uint32_t)hicache->instance);

  LL_ICACHE_EnableMonitors(p_icachex, monitor_type);

  return HAL_OK;
}

/**
  * @brief  Disable the ICACHE performance monitoring.
  * @param  hicache Pointer to a hal_icache_handle_t structure that contains
  *                 the handle information for the specified ICACHE instance.
  * @note   Stopping the monitoring does not reset the values.
  * @param  monitor_type It can be a combination of the following values:
  *         @arg HAL_ICACHE_MONITOR_HIT
  *         @arg HAL_ICACHE_MONITOR_MISS
  *         @arg HAL_ICACHE_MONITOR_ALL
  * @retval HAL_OK ICACHE Monitor(s) disabled successfully.
  */
hal_status_t HAL_ICACHE_DisableMonitors(hal_icache_handle_t *hicache, uint32_t monitor_type)
{
  ICACHE_TypeDef *p_icachex;

  /* Check the ICACHE handle allocation */
  ASSERT_DBG_PARAM(hicache != NULL);

  /* Check the monitor type (HIT, MISS or both) */
  ASSERT_DBG_PARAM(IS_ICACHE_MONITOR_TYPE(monitor_type));

  /* Check the global state */
  ASSERT_DBG_STATE(hicache->global_state,
                   (uint32_t)HAL_ICACHE_STATE_IDLE | \
                   (uint32_t)HAL_ICACHE_STATE_ACTIVE | \
                   (uint32_t)HAL_ICACHE_STATE_MAINTENANCE);

  p_icachex = (ICACHE_TypeDef *)((uint32_t)hicache->instance);

  LL_ICACHE_DisableMonitors(p_icachex, monitor_type);

  return HAL_OK;
}

/**
  * @brief  Reset the ICACHE performance monitoring values.
  * @param  hicache Pointer to a hal_icache_handle_t structure that contains
  *                 the handle information for the specified ICACHE instance.
  * @param  monitor_type It can be a combination of the following values:
  *         @arg HAL_ICACHE_MONITOR_HIT
  *         @arg HAL_ICACHE_MONITOR_MISS
  *         @arg HAL_ICACHE_MONITOR_ALL
  * @retval HAL_OK Monitor(s) reset successfully.
  */
hal_status_t HAL_ICACHE_ResetMonitors(hal_icache_handle_t *hicache, uint32_t monitor_type)
{
  ICACHE_TypeDef *p_icachex;

  /* Check the ICACHE handle allocation */
  ASSERT_DBG_PARAM(hicache != NULL);

  /* Check the monitor type (HIT, MISS or both) */
  ASSERT_DBG_PARAM(IS_ICACHE_MONITOR_TYPE(monitor_type));

  /* Check the global state */
  ASSERT_DBG_STATE(hicache->global_state,
                   (uint32_t)HAL_ICACHE_STATE_IDLE | \
                   (uint32_t)HAL_ICACHE_STATE_ACTIVE | \
                   (uint32_t)HAL_ICACHE_STATE_MAINTENANCE);

  p_icachex = (ICACHE_TypeDef *)((uint32_t)hicache->instance);

  LL_ICACHE_ResetMonitors(p_icachex, monitor_type);

  return HAL_OK;
}

/**
  * @brief  Get the ICACHE performance Hit monitoring value.
  * @param  hicache Pointer to a hal_icache_handle_t structure that contains
  *                 the handle information for the specified ICACHE instance.
  * @note   Upon reaching the maximum value, monitor does not wrap.
  * @retval uint32_t Hit monitoring value.
  */
uint32_t HAL_ICACHE_GetMonitorHitValue(const hal_icache_handle_t *hicache)
{
  ICACHE_TypeDef *p_icachex;

  /* Check the ICACHE handle allocation */
  ASSERT_DBG_PARAM(hicache != NULL);

  /* Check the global state */
  ASSERT_DBG_STATE(hicache->global_state,
                   (uint32_t)HAL_ICACHE_STATE_IDLE | \
                   (uint32_t)HAL_ICACHE_STATE_ACTIVE | \
                   (uint32_t)HAL_ICACHE_STATE_MAINTENANCE);

  p_icachex = (ICACHE_TypeDef *)((uint32_t)hicache->instance);

  return (LL_ICACHE_GetHitMonitor(p_icachex));
}

/**
  * @brief  Get the ICACHE performance Miss monitoring value.
  * @param  hicache Pointer to a hal_icache_handle_t structure that contains
  *                 the handle information for the specified ICACHE instance.
  * @note   Upon reaching the maximum value, monitor does not wrap.
  * @retval uint32_t Miss monitoring value.
  */
uint32_t HAL_ICACHE_GetMonitorMissValue(const hal_icache_handle_t *hicache)
{
  ICACHE_TypeDef *p_icachex;

  /* Check the ICACHE handle allocation */
  ASSERT_DBG_PARAM(hicache != NULL);

  /* Check the global state */
  ASSERT_DBG_STATE(hicache->global_state,
                   (uint32_t)HAL_ICACHE_STATE_IDLE | \
                   (uint32_t)HAL_ICACHE_STATE_ACTIVE | \
                   (uint32_t)HAL_ICACHE_STATE_MAINTENANCE);

  p_icachex = (ICACHE_TypeDef *)((uint32_t)hicache->instance);

  return (LL_ICACHE_GetMissMonitor(p_icachex));
}
/**
  * @}
  */

/** @addtogroup ICACHE_Exported_Functions_Group6
  * @{
This section provides functions to launch maintenance operations:
 - Call HAL_ICACHE_Invalidate() to invalidate the Instruction Cache in polling mode.
 - Call HAL_ICACHE_Invalidate_IT() to launch the invalidation of the Instruction Cache in interrupt mode.
  */

/**
  * @brief  Invalidate the ICACHE.
  * @param  hicache Pointer to the ICACHE handle.
  * @retval HAL_OK ICACHE invalidate operation completed successfully.
  * @retval HAL_TIMEOUT ICACHE invalidate operation timeout.
  * @retval HAL_ERROR Operation error.
  */
hal_status_t HAL_ICACHE_Invalidate(hal_icache_handle_t *hicache)
{
  uint32_t tickstart;
  ICACHE_TypeDef *p_icachex;
  hal_status_t status = HAL_OK;

  /* Check the ICACHE handle allocation */
  ASSERT_DBG_PARAM(hicache != NULL);

  /* Check the global state */
  ASSERT_DBG_STATE(hicache->global_state, HAL_ICACHE_STATE_ACTIVE);

  p_icachex = (ICACHE_TypeDef *)((uint32_t)hicache->instance);

#if defined(USE_HAL_ICACHE_GET_LAST_ERRORS) && (USE_HAL_ICACHE_GET_LAST_ERRORS == 1)
  hicache->last_error_codes = HAL_ICACHE_ERROR_NONE;
#endif /* USE_HAL_ICACHE_GET_LAST_ERRORS */

  /* Check no ongoing operation */
  if (LL_ICACHE_IsActiveFlag_BUSY(p_icachex) == 0U)
  {
    hicache->global_state = HAL_ICACHE_STATE_MAINTENANCE;

    /* Launch ICACHE invalidation */
    LL_ICACHE_Invalidate(p_icachex);
  }

  tickstart = HAL_GetTick();

  /* Wait for end of ICACHE invalidation */
  while (LL_ICACHE_IsActiveFlag_BSYEND(p_icachex) == 0U)
  {
    if ((HAL_GetTick() - tickstart) > ICACHE_MAINTENANCE_TIMEOUT_VALUE)
    {
      /* New check to avoid false timeout detection during preemption. */
      if ((LL_ICACHE_IsActiveFlag_BSYEND(p_icachex)) == 0UL)
      {
        status = HAL_TIMEOUT;
        break;
      }
    }
  }

