MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_icache.c
  /* Clear BSYENDF */
  LL_ICACHE_ClearFlag_BSYEND(p_icachex);

  hicache->global_state = HAL_ICACHE_STATE_ACTIVE;

#if defined(USE_HAL_ICACHE_GET_LAST_ERRORS) && (USE_HAL_ICACHE_GET_LAST_ERRORS == 1)
  uint32_t error_flags = LL_ICACHE_IsActiveFlag(p_icachex, LL_ICACHE_SR_ERRF);
  if (error_flags != 0U)
  {
    hicache->last_error_codes = HAL_ICACHE_ERROR_WRITE_INTRUSION;
    status = HAL_ERROR;
  }
#endif /* USE_HAL_ICACHE_GET_LAST_ERRORS */

  return status;
}

/**
  * @brief  Invalidate the ICACHE with interrupt.
  * @param  hicache Pointer to the ICACHE handle.
  * @retval HAL_OK ICACHE invalidate operation started successfully.
  * @retval HAL_BUSY ICACHE driver busy with another ongoing operation.
  */
hal_status_t HAL_ICACHE_Invalidate_IT(hal_icache_handle_t *hicache)
{
  ICACHE_TypeDef *p_icachex;

  /* Check the ICACHE handle allocation */
  ASSERT_DBG_PARAM(hicache != NULL);

  /* Check the global state */
  ASSERT_DBG_STATE(hicache->global_state, HAL_ICACHE_STATE_ACTIVE);

  p_icachex = (ICACHE_TypeDef *)((uint32_t)hicache->instance);

#if defined(USE_HAL_ICACHE_GET_LAST_ERRORS) && (USE_HAL_ICACHE_GET_LAST_ERRORS == 1)
  hicache->last_error_codes = HAL_ICACHE_ERROR_NONE;
#endif /* USE_HAL_ICACHE_GET_LAST_ERRORS */

  /* Check no ongoing operation */
  if (LL_ICACHE_IsActiveFlag_BUSY(p_icachex) != 0U)
  {
    return HAL_BUSY;
  }
  else
  {
    hicache->global_state = HAL_ICACHE_STATE_MAINTENANCE;

    /* Make sure BSYENDF is reset before to start ICACHE invalidation */
    LL_ICACHE_ClearFlag_BSYEND(p_icachex);

    /* Enable end of ICACHE invalidation interrupt */
    LL_ICACHE_EnableIT_BSYEND(p_icachex);

    /* Launch ICACHE invalidation */
    LL_ICACHE_Invalidate(p_icachex);
  }
  return HAL_OK;
}
/**
  * @}
  */

/** @addtogroup ICACHE_Exported_Functions_Group7
  * @{
The functions are :
- HAL_ICACHE_IRQHandler() to manage the two types of interrupt : Error or Invalidate.
- HAL_ICACHE_ErrorCallback() : Error Callback.
- HAL_ICACHE_InvalidateCompleteCallback() : Maintenance Callback.
- HAL_ICACHE_RegisterErrorCallback() to initialize the Error callback pointer.
- HAL_ICACHE_RegisterInvalidateCompleteCallback() to initialize the Invalidate callback pointer.
  * @note The register user callback functions can be used only if USE_HAL_ICACHE_REGISTER_CALLBACKS = 1
  */

/**
  * @brief  Handle the ICACHE interrupt request.
  * @param  hicache Pointer to the ICACHE handle.
  * @note  This function must be called from ICACHE_IRQHandler().
  * @note  This function disables the interrupt related to a detected operation flag.
  */
void HAL_ICACHE_IRQHandler(hal_icache_handle_t *hicache)
{
  ICACHE_TypeDef *p_icachex;
  uint32_t it_flags_sources;

  /* Check the ICACHE handle allocation */
  ASSERT_DBG_PARAM(hicache != NULL);

  /* Check the global state */
  ASSERT_DBG_STATE(hicache->global_state, (uint32_t)HAL_ICACHE_STATE_MAINTENANCE | (uint32_t)HAL_ICACHE_STATE_ACTIVE);

  p_icachex = (ICACHE_TypeDef *)((uint32_t)hicache->instance);

  /* Get current interrupt flags and interrupt sources value */
  it_flags_sources = LL_ICACHE_READ_REG(p_icachex, SR);
  it_flags_sources &= LL_ICACHE_READ_REG(p_icachex, IER);

  /* Check ICACHE Error interrupt flag */
  if ((it_flags_sources & LL_ICACHE_SR_ERRF) != 0U)
  {
#if defined(USE_HAL_ICACHE_GET_LAST_ERRORS) && (USE_HAL_ICACHE_GET_LAST_ERRORS == 1)
    hicache->last_error_codes = HAL_ICACHE_ERROR_WRITE_INTRUSION;
#endif /* USE_HAL_ICACHE_GET_LAST_ERRORS */

    /* Clear ICACHE error pending flag */
    LL_ICACHE_ClearFlag_ERR(p_icachex);

    /* Call the Error callback */
#if defined(USE_HAL_ICACHE_REGISTER_CALLBACKS) && (USE_HAL_ICACHE_REGISTER_CALLBACKS == 1)
    hicache->p_error_cb(hicache);
#else
    HAL_ICACHE_ErrorCallback(hicache);
#endif /* USE_HAL_ICACHE_REGISTER_CALLBACKS */
  }

  if ((it_flags_sources & LL_ICACHE_SR_BSYENDF) != 0U)
  {
    /* Disable end of ICACHE invalidation interrupt */
    LL_ICACHE_DisableIT_BSYEND(p_icachex);

    /* Clear end of ICACHE invalidation interrupt flag */
    LL_ICACHE_ClearFlag_BSYEND(p_icachex);

    hicache->global_state = HAL_ICACHE_STATE_ACTIVE;

    /* Call the invalidate complete callback */
#if defined(USE_HAL_ICACHE_REGISTER_CALLBACKS) && (USE_HAL_ICACHE_REGISTER_CALLBACKS == 1)
    hicache->p_invalidate_cplt_cb(hicache);
#else
    HAL_ICACHE_InvalidateCompleteCallback(hicache);
#endif /* USE_HAL_ICACHE_REGISTER_CALLBACKS */
  }
}

/**
  * @brief  ICACHE Error callback.
  * @param  hicache Pointer to a hal_icache_handle_t structure that contains
  *                 the handle information for the specified ICACHE instance.
  */
__WEAK void HAL_ICACHE_ErrorCallback(hal_icache_handle_t *hicache)
{
  /* Check the ICACHE handle allocation */
  ASSERT_DBG_PARAM(hicache != NULL);

  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hicache);

  /* NOTE : This function must not be modified in this file, when the callback is needed,
            the HAL_ICACHE_ErrorCallback() must preferably be implemented in the user file
   */
}

/**
  * @brief  ICACHE Invalidate complete callback.
  * @param  hicache Pointer to a hal_icache_handle_t structure that contains
  *                 the handle information for the specified ICACHE instance.
  */
__WEAK void HAL_ICACHE_InvalidateCompleteCallback(hal_icache_handle_t *hicache)
{
  /* Check the ICACHE handle allocation */
  ASSERT_DBG_PARAM(hicache != NULL);

  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hicache);

  /* NOTE : This function must not be modified in this file, when the callback is needed,
            the HAL_ICACHE_InvalidateCompleteCallback() can be implemented in the user file
   */
}

#if defined(USE_HAL_ICACHE_REGISTER_CALLBACKS) && (USE_HAL_ICACHE_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register a User ICACHE callback for error.
  * @param  hicache Pointer to a hal_icache_handle_t structure that contains
  *                 the handle information for the specified ICACHE instance.
  * @param  p_callback Pointer to the hal_icache_error_cb_t Error Callback function.
  * @note   The function is only available if USE_HAL_ICACHE_REGISTER_CALLBACKS = 1.
  * @retval HAL_OK Callback registered successfully.
  * @retval HAL_INVALID_PARAM p_callback pointer is NULL.
  */
hal_status_t HAL_ICACHE_RegisterErrorCallback(hal_icache_handle_t *hicache, hal_icache_cb_t p_callback)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM(hicache != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

  /* Check the global state */
  ASSERT_DBG_STATE(hicache->global_state, (uint32_t)HAL_ICACHE_STATE_IDLE);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  /* Check the p_callback pointer */
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hicache->p_error_cb = p_callback;
  return HAL_OK;
}

/**
  * @brief  Register a User ICACHE callback for invalidate.
  * @param hicache Pointer to a hal_icache_handle_t structure that contains
  *                the handle information for the specified ICACHE instance.
  * @param p_callback Pointer to the hal_icache_cb_t Callback function.
  * @note   The function is only available if USE_HAL_ICACHE_REGISTER_CALLBACKS = 1.
  * @retval HAL_OK Callback registered successfully.
  * @retval HAL_INVALID_PARAM p_callback pointer is NULL.
  */
hal_status_t HAL_ICACHE_RegisterInvalidateCompleteCallback(hal_icache_handle_t *hicache, hal_icache_cb_t p_callback)
{
  /* Check the parameters */
  ASSERT_DBG_PARAM(hicache != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  /* Check the p_callback pointer */
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  /* Check the global state */
  ASSERT_DBG_STATE(hicache->global_state, (uint32_t)HAL_ICACHE_STATE_IDLE | (uint32_t)HAL_ICACHE_STATE_ACTIVE);

  hicache->p_invalidate_cplt_cb = p_callback;
  return HAL_OK;
}
#endif  /* USE_HAL_ICACHE_REGISTER_CALLBACKS */
/**
  * @}
  */

/** @addtogroup ICACHE_Exported_Functions_Group8
  * @{
The function is :
- HAL_ICACHE_GetState() to retrieve the state value.
  */
/**
  * @brief  Get the ICACHE handle state.
  * @param  hicache Pointer to a hal_icache_handle_t structure that contains
  *                 the handle information for the specified ICACHE instance.
  * @retval HAL_ICACHE_STATE_RESET ICACHE driver not initialized and not started.
  * @retval HAL_ICACHE_STATE_IDLE ICACHE driver initialized and not started.
  * @retval HAL_ICACHE_STATE_ACTIVE ICACHE driver initialized and started.
  * @retval HAL_ICACHE_STATE_MAINTENANCE ICACHE driver initialized, started and a maintenance operation is ongoing.
  */
hal_icache_state_t HAL_ICACHE_GetState(const hal_icache_handle_t *hicache)
{
  /* Check the ICACHE handle allocation */
  ASSERT_DBG_PARAM(hicache != NULL);

  return hicache->global_state;
}

/**
  * @}
  */

#if defined(USE_HAL_ICACHE_GET_LAST_ERRORS) && (USE_HAL_ICACHE_GET_LAST_ERRORS == 1)
/** @addtogroup ICACHE_Exported_Functions_Group9
  * @{
This section permits to get in runtime the last error codes of the peripheral ICACHE.
- HAL_ICACHE_GetLastErrorCodes() to get the ICACHE last error codes.
  */
/**
  * @brief  Get the ICACHE last error codes.
  * @param  hicache Pointer to a hal_icache_handle_t structure that contains
  *                 the handle information for the specified ICACHE instance.
  * @retval HAL_ICACHE_ERROR_NONE
  * @retval HAL_ICACHE_ERROR_WRITE_INTRUSION
  */
uint32_t HAL_ICACHE_GetLastErrorCodes(const hal_icache_handle_t *hicache)
{
  /* Check the ICACHE handle allocation */
  ASSERT_DBG_PARAM(hicache != NULL);

  /* Return the ICACHE last error codes */
  return hicache->last_error_codes;
}

/**
  * @}
  */
#endif /* USE_HAL_ICACHE_GET_LAST_ERRORS */

/** @addtogroup ICACHE_Exported_Functions_Group10
  * @{
This section provides functions to set and get user data:
- HAL_ICACHE_SetUserData() to store the user data into the ICACHE handle.
- HAL_ICACHE_GetUserData() retrieve the user data from the ICACHE handle.
- HAL_ICACHE_GetInstance() to get the HAL ICACHE instance.
- HAL_ICACHE_GetLLInstance() to get the hardware ICACHE instance.
  */

#if defined(USE_HAL_ICACHE_USER_DATA) && (USE_HAL_ICACHE_USER_DATA == 1)
/**
  * @brief Store the user data into the ICACHE handle.
  * @param hicache Pointer to a hal_icache_handle_t structure that contains
  *                the handle information for the specified ICACHE instance.
  * @param p_user_data Pointer to the user data.
  */
void HAL_ICACHE_SetUserData(hal_icache_handle_t *hicache, const void *p_user_data)
{
  /* Check the ICACHE handle allocation */
  ASSERT_DBG_PARAM(hicache != NULL);

  /* Set user data */
  hicache->p_user_data = p_user_data;
}

/**
  * @brief  Retrieve the user data from the ICACHE handle.
  * @param hicache Pointer to a hal_icache_handle_t structure that contains
  *                the handle information for the specified ICACHE instance.
  * @retval Pointer to the user data.
  */
const void *HAL_ICACHE_GetUserData(const hal_icache_handle_t *hicache)
{
  /* Check the ICACHE handle allocation */
  ASSERT_DBG_PARAM(hicache != NULL);

  return (hicache->p_user_data);
}
#endif /* USE_HAL_ICACHE_USER_DATA */

/**
  * @brief  Get the HAL ICACHE instance.
  * @param  hicache Pointer to a \ref hal_icache_handle_t structure.
  * @retval The HAL ICACHE instance.
  */
hal_icache_t HAL_ICACHE_GetInstance(const hal_icache_handle_t *hicache)
{
  ASSERT_DBG_PARAM(hicache != NULL);
  ASSERT_DBG_PARAM(IS_ICACHE_ALL_INSTANCE((ICACHE_TypeDef *)((uint32_t)hicache->instance)));

  return (hicache->instance);
}

/**
  * @brief  Get the hardware ICACHE instance.
  * @param  hicache Pointer to a \ref hal_icache_handle_t structure.
  * @retval The hardware ICACHE instance.
  */
ICACHE_TypeDef *HAL_ICACHE_GetLLInstance(const hal_icache_handle_t *hicache)
{
  ASSERT_DBG_PARAM(hicache != NULL);
  ASSERT_DBG_PARAM(IS_ICACHE_ALL_INSTANCE((ICACHE_TypeDef *)((uint32_t)hicache->instance)));

  return ((ICACHE_TypeDef *)((uint32_t)((hicache)->instance)));
}

/**
  * @}
  */

/**
  * @}
  */

#endif /* USE_HAL_ICACHE_MODULE */
#endif /* ICACHE */

/**
  * @}
  */

/**
  * @}
  */
